/*
 * @Author: tanshaobo
 * @Date: 2025-05-02 00:50:05
 * @LastEditors: tanshaobo
 * @LastEditTime: 2025-05-02 02:30:40
 * @Description: 稻妻-圣遗物
 * @FilePath: \yuanshen-utils\src\config\Area\DaoQi\relics.js
 */

import { DaoQi } from './index'

let arr = [
  {
      "title": "长夜之誓",
      "filter": [
          "星级/五星","套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "下落攻击造成的伤害提升25%。"
      },
      "list2": {
          "key": "4件套",
          "value": "装备者的下落攻击/重击/元素战技 命中敌人后，获得1/2/2层「永照的流辉」， 由下落攻击、重击或元素战技产生的该效果 分别每秒至多触发一次。永照的流辉：下落 攻击造成的伤害提升15%，持续6秒，至多 叠加5层，每层持续时间独立计算。"
      }
  },
  {
      "title": "深廊终曲",
      "filter": [
          "星级/五星","套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "获得15%冰元素伤害加成。"
      },
      "list2": {
          "key": "4件套",
          "value": "装备者的元素能量为0时，普通攻击造成的伤害提升60%，元素爆发造成的伤害提升60%。装备者的普通攻击造成伤害后，上述元素爆发伤害提升效果将失效6秒；装备者的元素爆发造成伤害后，上述普通攻击伤害提升效果将失效6秒。角色处于队伍后台也能触发。"
      }
  },
  {
      "title": "黑曜秘典",
      "filter": [
          "星级/五星","套装效果/暴击率",
          "套装效果/伤害加成"
      ],
      "list1": {
          "key": "2件套",
          "value": "装备者处于夜魂加持状态，并且在场上时，造成的伤害提高15%。"
      },
      "list2": {
          "key": "4件套",
          "value": "装备者在场上消耗1点夜魂值后暴击率提高40%，持续6秒。该效果每1秒至多触发一次。"
      }
  },
  {
      "title": "烬城勇者绘卷",
      "filter": [
          "星级/五星","套装效果/伤害加成",
          "套装效果/元素能量回复"
      ],
      "list1": {
          "key": "2件套",
          "value": "队伍中附近的角色触发「夜魂迸发」时，装备者恢复6点元素能量。"
      },
      "list2": {
          "key": "4件套",
          "value": "装备者触发其对应元素类型的相关反应后，队伍中附近的所有角色的该元素反应相关的元素伤害加成提升12%，持续15秒。若触发该效果时，装备者处于夜魂加持状态下，还将使队伍中附近的所有角色的与该元素反应相关的元素伤害加成提升28%，持续20秒装备者处于后台时也能触发上述效果同名圣遗物套装产生的伤害加成效果无法叠加。"
      }
  },
  {
      "title": "未竟的遐思",
      "filter": [
          "星级/五星","套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "攻击力提高18%"
      },
      "list2": {
          "key": "4件套",
          "value": "脱离战斗状态3秒后，造成的伤害提升50%。在战斗状态下，附近不存在处于燃烧状态下的敌人超过6秒后，上述伤害提升效果每秒降低10%直到降低至0%;存在处于燃烧状态下的敌人时，每秒提升10%，直到达到50%。装备此圣遗物套装的角色处于队伍后台时，依然会触发该效果。"
      }
  },
  {
      "title": "谐律异想断章",
      "filter": [
          "星级/五星","套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "攻击力提高18%"
      },
      "list2": {
          "key": "4件套",
          "value": "生命之契的数值提升或降低时角色造成的伤害提升18%，该效果持续6秒，至多叠加3次。"
      }
  },
  {
      "title": "回声之林夜话",
      "filter": [
          "星级/五星","套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": " 攻击力提高18%。"
      },
      "list2": {
          "key": "4件套",
          "value": "施放元素战技后的10秒内，岩元素伤害加成提升20%；若处于结晶反应产生的护盾庇护下，上述效果提高150%，进一步提高的效果将在失去结晶护盾庇护的1秒后移除。"
      }
  },
  {
      "title": "昔时之歌",
      "filter": [
          "星级/五星","套装效果/伤害加成",
          "套装效果/治疗效果",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "治疗加成提高15%。"
      },
      "list2": {
          "key": "4件套",
          "value": "装备者对队伍中的角色进行治疗时将产生持续6秒的渴盼效果，记录治疗的生命值回复量（包括溢出值）。持续时间结束时，渴盼效果将转变为「彼时的浪潮」效果：队伍中自己的当前场上角色的普通攻击、重击、下落攻击、元素战技与元素爆发命中敌人时，将基于渴盼效果所记录的回复量的8%提高造成的伤害，「彼时的浪潮」将在生效5次或10秒后移除。一次渴盼效果至多记录15000点回复量，同时至多存在一个能够记录多个装备者的产生的回复量；装备者处于队伍后台时，依然能触发该效果。"
      }
  },
  {
      "title": "逐影猎人",
      "filter": [
          "星级/五星","套装效果/暴击率",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套效果",
          "value": "普通攻击与重击造成的伤害提高15%。"
      },
      "list2": {
          "key": "4件套效果",
          "value": "当前生命值提升或降低时，暴击率提升12%，该效果持续5秒，至多叠加3次。"
      }
  },
  {
      "title": "黄金剧团",
      "filter": [
          "星级/五星","套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套效果",
          "value": "元素战技造成的伤害提升20%。"
      },
      "list2": {
          "key": "4件套效果",
          "value": "元素战技造成的伤害提升25%；此外，处于队伍后台时，元素战技造成的伤害还将进一步提升25%，该效果将在登场后2秒移除。"
      }
  },
  {
      "title": "花海甘露之光",
      "filter": [
          "星级/五星","套装效果/生命值",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "生命值提升20%"
      },
      "list2": {
          "key": "4件套",
          "value": "元素战技与元素爆发造成的伤害提升10%；装备者受到伤害后的5秒内，上述伤害提升效果提高80%。该提高效果至多叠加5层。每层持续时间独立计算，处于队伍后台时依然能触发该效果。"
      }
  },
  {
      "title": "水仙之梦",
      "filter": [
          "星级/五星","套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套",
          "value": "获得15%水元素伤害加成"
      },
      "list2": {
          "key": "4件套",
          "value": "普通攻击、重击、下落攻击、元素战技或元素爆发命中敌人后，将产生1层持续8秒的「镜中水仙」效果。处于1/2/3层及以上「镜中水仙」效果下时，攻击力 将提高7%/16%/25%，水元素伤害加成提升4%/9%/15%。由普通攻击、重击、下落攻击、元素战技或元素爆发产生的「镜中水仙」将分别独立存在。"
      }
  },
  {
      "title": "乐园遗落之花",
      "filter": [
          "星级/五星","套装效果/元素精通",
          "套装效果/反应系数加成",
          "套装效果/额外伤害",
          "获取方式/秘境",
          "获取方式/深境螺旋"
      ],
      "list1": {
          "key": "2件套",
          "value": "元素精通提高80点。"
      },
      "list2": {
          "key": "4件套",
          "value": "装备者绽放、超绽放、烈绽放反应造成的伤害提升40%。此外，装备者触发绽放、超绽放、烈绽放后，上述效果带来的加成提升25%，该效果持续10秒，至多叠加4次，每1秒至多触发一次。装备者处于队伍后台时依然能触发该效果。"
      }
  },
  {
      "title": "沙上楼阁史话",
      "filter": ["星级/五星",
          "套装效果/伤害加成",
          "获取方式/深境螺旋",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%风元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "重击命中敌人后，该角色的普通攻击速度提升10%，普通攻击、重击与下落攻击造成的伤害提升40%，持续15秒。"
      }
  },
  {
      "title": "深林的记忆",
      "filter": [
          "星级/五星","套装效果/伤害加成",
          "套装效果/元素抗性",
          "获取方式/秘境",
          "获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%草元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "元素战技或元素爆发命中敌人后，使命中目标的草元素抗性降低30%，持续8秒。装备者处于队伍后台时，依然能触发该效果。"
      }
  },
  {
      "title": "饰金之梦",
      "filter": [
          "星级/五星",
          "套装效果/元素精通",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "元素精通提高80点。"
      },
      "list2": {
          "key": "4件套：",
          "value": "触发元素反应后的8秒内，会根据队伍内其他角色的元素类型，使装备者获得强化：队伍中每存在1个和装备者同类元素的角色，攻击力提升14%；每存在1个和装备者不同元素类型的角色，元素精通提升50点。上述每类效果至多计算3个角色。该效果每8秒至多触发一次。装备者处于队伍后台时，依然能触发该效果。"
      }
  },
  {
      "title": "辰砂往生录",
      "filter": [
          "星级/五星",
          "获取方式/秘境",
          "套装效果/攻击力"
      ],
      "list1": {
          "key": "2件套：",
          "value": "攻击力提高18%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "施放元素爆发后，将产生持续16秒的「潜光」效果：攻击力提升8%；并在角色的生命值降低时，攻击力进一步提升10%，至多通过这种方式提升4次，每0.8秒至多触发一次。「潜光」效果将在角色退场时消失；持续期间再次施放元素爆发，将移除原有的「潜光」。"
      }
  },
  {
      "title": "来歆余响",
      "filter": [
          "星级/五星",
          "获取方式/秘境",
          "套装效果/攻击力"
      ],
      "list1": {
          "key": "2件套：",
          "value": "攻击力提高18%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "普通攻击命中敌人时，有36%概率触发「幽谷祝祀」：普通攻击造成的伤害提高，伤害提高值为攻击力的70%，该效果将在普通攻击造成伤害后的0.05秒后清除。普通攻击未触发「幽谷祝祀」时，会使下次触发概率提升20%；0.2秒内至多判定1次触发与否。"
      }
  },
  {
      "title": "华馆梦醒形骸记",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/防御力",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "防御力提高30%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "装备此圣遗物套装的角色在以下情况下，将获得「问答」效果：在场上用岩元素攻击命中敌人后获得一层，每0.3秒至多触发一次；在队伍后台中，每3秒获得一层。问答至多叠加4层，每层能提供6%防御力与6%岩元素伤害加成。每6秒，若未获得问答效果，将损失一层。"
      }
  },
  {
      "title": "海染砗磲",
      "filter": [
          "星级/五星",
          "套装效果/治疗加成",
          "套装效果/额外伤害",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "治疗加成提高15%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "装备此圣遗物套装的角色对队伍中的角色进行治疗时，将产生持续3秒的海染泡沫，记录治疗的生命值回复量（包括溢出值）。持续时间结束时，海染泡沫将会爆炸，对周围的敌人造成90%累计回复量的伤害（该伤害结算方式同感电、超导等元素反应，但不受元素精通、等级或反应伤害加成效果影响）。每3.5秒至多产生一个海染泡沫；海染泡沫至多记录30000点回复量，含溢出部分的治疗量；自己的队伍中同时至多存在一个海染泡沫。装备此圣遗物套装的角色处于队伍后台时；依然能触发该效果。"
      }
  },
  {
      "title": "绝缘之旗印",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/元素充能效率",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "元素充能效率提高20%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "基于元素充能效率的25%，提高元素爆发造成的伤害。至多通过这种方式获得75%提升。"
      }
  },
  {
      "title": "追忆之注连",
      "filter": [
          "星级/五星",
          "套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "攻击力提高18%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "释放元素战技时，如果角色的元素能量高于或等于15点，则会流失15点元素能量，使接下来的10秒内，普通攻击、重击、下落攻击造成的伤害提高50%，持续期间内效果不会再次触发。"
      }
  },
  {
      "title": "千岩牢固",
      "filter": [
          "星级/五星",
          "套装效果/攻击力",
          "套装效果/生命值",
          "获取方式/秘境",
          "套装效果/护盾强效"
      ],
      "list1": {
          "key": "2件套：",
          "value": "生命值提升20%"
      },
      "list2": {
          "key": "4件套：",
          "value": "元素战技命中敌人后，使队伍中附近的所有角色攻击力提升20%，护盾强效提升30%，持续3秒。该效果每0.5秒至多触发一次。装备此圣遗物套装的角色处于队伍后台时，依然能触发该效果。"
      }
  },
  {
      "title": "苍白之火",
      "filter": [
          "星级/五星",
          "套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "造成的物理伤害提高25%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "元素战技命中敌人后，攻击力提升9%。该效果持续7秒，至多叠加2层，每0.3秒至多触发一次。叠满2层时，2件套的效果提升100%。"
      }
  },
  {
      "title": "平息鸣雷的尊者",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/元素抗性",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "雷元素抗性提高40%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "对处于雷元素影响下的敌人造成的伤害提升35%。"
      }
  },
  {
      "title": "炽烈的炎之魔女",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/反应系数加成",
          "获取方式/秘境",
          "获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%火元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "超载、燃烧、烈绽放反应造成的伤害提升40%，蒸发、融化反应的加成系数提高15%。施放元素战技后的10秒内，2件套的效果提高50%，该效果最多叠加3次。"
      }
  },
  {
      "title": "流浪大地的乐团",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/元素精通",
          "获取方式/征讨领域",
          "获取方式/BOSS"
      ],
      "list1": {
          "key": "2件套：",
          "value": "元素精通提高80点。"
      },
      "list2": {
          "key": "4件套：",
          "value": "装备该圣遗物套装的角色为法器、弓箭角色时，角色重击造成的伤害提高35%。"
      }
  },
  {
      "title": "染血的骑士道",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "造成的物理伤害提高25%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "击败敌人后的10秒内，施放重击时不消耗体力，且重击造成的伤害提升50%。"
      }
  },
  {
      "title": "被怜爱的少女",
      "filter": [
          "星级/五星",
          "套装效果/治疗效果",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "角色造成的治疗效果提升15%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "施放元素战技或元素爆发后的10秒内，队伍中所有角色受治疗效果加成提高20%。"
      }
  },
  {
      "title": "角斗士的终幕礼",
      "filter": [
          "星级/五星",
          "套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/征讨领域",
          "获取方式/BOSS",
          "获取方式/见闻"
      ],
      "list1": {
          "key": "2件套：",
          "value": "攻击力提高18%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "装备该圣遗物套装的角色为单手剑、双手剑、长柄武器角色时，角色普通攻击造成的伤害提高35%。"
      }
  },
  {
      "title": "渡过烈火的贤人",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/元素抗性",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "火元素抗性提高40%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "对处于火元素影响下的敌人造成的伤害提升35%。"
      }
  },
  {
      "title": "悠古的磐岩",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "获取方式/秘境",
          "获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%岩元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "获得结晶反应形成的晶片时，队伍中所有角色获得35%对应元素伤害加成，持续10秒。同时只能通过该效果获得一种元素伤害加成。"
      }
  },
  {
      "title": "如雷的盛怒",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/冷却时间",
          "套装效果/反应系数加成",
          "获取方式/秘境","获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%雷元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "超载、感电、超导、超绽放反应造成的伤害提升40%，超激化反应带来的伤害提升提高20%。触发上述元素反应或原激化反应时，元素战技冷却时间减少1秒。该效果每0.8秒最多触发一次。"
      }
  },
  {
      "title": "沉沦之心",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "获取方式/秘境","获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%水元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "施放元素战技后的15秒内，普通攻击与重击造成的伤害提高30%。"
      }
  },
  {
      "title": "逆飞的流星",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/护盾强效",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "护盾强效提高35%。"
      },
      "list2": {
          "key": "4件套：",
          "value": "处于护盾庇护下时，额外获得40%普通攻击和重击伤害加成。"
      }
  },
  {
      "title": "昔日宗室之仪",
      "filter": [
          "星级/五星",
          "套装效果/攻击力",
          "套装效果/伤害加成",
          "获取方式/秘境"
      ],
      "list1": {
          "key": "2件套：",
          "value": "元素爆发造成的伤害提升20％。"
      },
      "list2": {
          "key": "4件套：",
          "value": "释放元素爆发后，队伍中所有角色攻击力提升20％，持续12秒，该效果不可叠加。"
      }
  },
  {
      "title": "翠绿之影",
      "filter": [
          "星级/五星",
          "套装效果/伤害加成",
          "套装效果/反应系数加成",
          "套装效果/元素抗性",
          "获取方式/秘境",
          "获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%风元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "扩散反应造成的伤害提升60%。根据扩散的元素类型，降低受到影响的敌人40%的对应元素抗性，持续10秒。"
      }
  },
  {
      "title": "冰风迷途的勇士",
      "filter": [
          "星级/五星",
          "套装效果/暴击率",
          "套装效果/伤害加成",
          "获取方式/秘境","获取方式/备战"
      ],
      "list1": {
          "key": "2件套：",
          "value": "获得15%冰元素伤害加成。"
      },
      "list2": {
          "key": "4件套：",
          "value": "攻击处于冰元素影响下的敌人时，暴击率提高20%；若敌人处于冻结状态下，则暴击率额外提高20%。"
      }
  }
]

export const relics = [
  {
    instanceId: 1,
    instanceLabel: '椛染之庭',
    id: 1,
    label: '追忆之注连'
  },
  {
    instanceId: 1,
    instanceLabel: '椛染之庭',
    id: 2,
    label: '追忆之注连'
  },
]